In [6]:
import ibm_db

In [7]:
#Credentials
dsn_hostname = "dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net" 
dsn_uid = "cbn72876"        
dsn_pwd = "8cchf-g04mvsft51"    

dsn_driver = "{IBM DB2 ODBC DRIVER}"
dsn_database = "BLUDB"           
dsn_port = "50000"                
dsn_protocol = "TCPIP"

In [8]:
#Create the dsn connection string
dsn = (
    "DRIVER={0};"
    "DATABASE={1};"
    "HOSTNAME={2};"
    "PORT={3};"
    "PROTOCOL={4};"
    "UID={5};"
    "PWD={6};").format(dsn_driver, dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd)

In [9]:
print(dsn)

DRIVER={IBM DB2 ODBC DRIVER};DATABASE=BLUDB;HOSTNAME=dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net;PORT=50000;PROTOCOL=TCPIP;UID=cbn72876;PWD=8cchf-g04mvsft51;

In [10]:
#Conecction

try:
    conn = ibm_db.connect(dsn, "", "")
    print ("Connected to database: ", dsn_database, "as user: ", dsn_uid, "on host: ", dsn_hostname)

except:
    print ("Unable to connect: ", ibm_db.conn_errormsg() )

Connected to database:  BLUDB as user:  cbn72876 on host:  dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net

In [11]:
#Retrieve Metadata for the Database Server
server = ibm_db.server_info(conn)

print ("DBMS_NAME: ", server.DBMS_NAME)
print ("DBMS_VER:  ", server.DBMS_VER)
print ("DB_NAME:   ", server.DB_NAME)

DBMS_NAME:  DB2/LINUXX8664
DBMS_VER:   11.01.0404
DB_NAME:    BLUDB

In [12]:
#Retrieve Metadata for the Database Client / Driver
client = ibm_db.client_info(conn)

print ("DRIVER_NAME:          ", client.DRIVER_NAME) 
print ("DRIVER_VER:           ", client.DRIVER_VER)
print ("DATA_SOURCE_NAME:     ", client.DATA_SOURCE_NAME)
print ("DRIVER_ODBC_VER:      ", client.DRIVER_ODBC_VER)
print ("ODBC_VER:             ", client.ODBC_VER)
print ("ODBC_SQL_CONFORMANCE: ", client.ODBC_SQL_CONFORMANCE)
print ("APPL_CODEPAGE:        ", client.APPL_CODEPAGE)
print ("CONN_CODEPAGE:        ", client.CONN_CODEPAGE)

DRIVER_NAME:           DB2CLI.DLL
DRIVER_VER:            11.05.0500
DATA_SOURCE_NAME:      BLUDB
DRIVER_ODBC_VER:       03.51
ODBC_VER:              03.01.0000
ODBC_SQL_CONFORMANCE:  EXTENDED
APPL_CODEPAGE:         1252
CONN_CODEPAGE:         1208

In [15]:
stmt = ibm_db.exec_immediate(conn, """CREATE TABLE Trucks(serial_no varchar(20) PRIMARY KEY NOT NULL,
                            model VARCHAR(20) NOT NULL,
                            manufacturer VARCHAR(20) NOT NULL,
                            Engine_size VARCHAR(20) NOT NULL,
                            Truck_Class VARCHAR(20) NOT NULL)""")

In [17]:
stmt = ibm_db.exec_immediate(conn, 
"""INSERT INTO Trucks(serial_no, model, manufacturer, Engine_size, Truck_Class)
VALUES ('A1234', 'Lonestar', 'Internacional Trucks', 'Cummins ISX15','Class 8' );
""")

In [18]:
stmt = ibm_db.exec_immediate(conn, 
"""INSERT INTO Trucks(serial_no, model, manufacturer, Engine_size, Truck_Class)
VALUES ('B5432', 'Volvo VN', 'Volvo Trucks', 'Volvo D11','Heavy Duty Class 8' );
""")

In [19]:
stmt = ibm_db.exec_immediate(conn, 
"""INSERT INTO Trucks(serial_no, model, manufacturer, Engine_size, Truck_Class)
VALUES ('C5674', 'Kenworth W900', 'Kenworth Truck Co', 'Caterpillar C9','Class 8' );
""")

In [21]:
#SELECT ALL

stmt = ibm_db.exec_immediate(conn, "SELECT * FROM Trucks")

ibm_db.fetch_both(stmt)

{'SERIAL_NO': 'A1234',
 0: 'A1234',
 'MODEL': 'Lonestar',
 1: 'Lonestar',
 'MANUFACTURER': 'Internacional Trucks',
 2: 'Internacional Trucks',
 'ENGINE_SIZE': 'Cummins ISX15',
 3: 'Cummins ISX15',
 'TRUCK_CLASS': 'Class 8',
 4: 'Class 8'}

In [22]:
import pandas as pd
import ibm_db_dbi

In [23]:
pconn = ibm_db_dbi.Connection(conn)

In [24]:
df = pd.read_sql('SELECT * FROM Trucks', pconn)

In [25]:
df.head()

,SERIAL_NO,MODEL,MANUFACTURER,ENGINE_SIZE,TRUCK_CLASS
0,A1234,Lonestar,Internacional Trucks,Cummins ISX15,Class 8
1,B5432,Volvo VN,Volvo Trucks,Volvo D11,Heavy Duty Class 8
2,C5674,Kenworth W900,Kenworth Truck Co,Caterpillar C9,Class 8

In [27]:
createQuery = "create table INSTRUCTOR(id INTEGER PRIMARY KEY NOT NULL, fname VARCHAR(20) NOT NULL)"

#Now fill in the name of the method and execute the statement
createStmt = ibm_db.exec_immediate(conn, createQuery)

In [30]:
#Drop table
createQuery = "DROP TABLE INSTRUCTOR"
smtm = ibm_db.exec_immediate(conn, createQuery)

In [31]:
createQuery = "create table INSTRUCTOR(id INTEGER PRIMARY KEY NOT NULL, fname VARCHAR(20) NOT NULL,Lname VARCHAR(20) NOT NULL, CITY VARCHAR(20) NOT NULL, CCODE CHARACTER(2) NOT NULL )"

#Now fill in the name of the method and execute the statement
createStmt = ibm_db.exec_immediate(conn, createQuery)

In [35]:
#INSERT VALUES

createQuery = """
INSERT INTO INSTRUCTOR(id , fname, Lname, City, Ccode)
VALUES(1, 'Rav', 'Ahuja', 'TORONTO', 'CA'),
(2, 'Raul', 'Chong', 'Markham', 'CA'),
(3, 'Hima', 'Vasudevan', 'Chicago', 'US');
"""

In [36]:
stmt = ibm_db.exec_immediate(conn, createQuery)

In [38]:
query = "SELECT * FROM INSTRUCTOR"
selectStmt = ibm_db.exec_immediate(conn, query)

#Fetch the Dictionary (for the first row only)
ibm_db.fetch_both(selectStmt)

{'ID': 1,
 0: 1,
 'FNAME': 'Rav',
 1: 'Rav',
 'LNAME': 'Ahuja',
 2: 'Ahuja',
 'CITY': 'TORONTO',
 3: 'TORONTO',
 'CCODE': 'CA',
 4: 'CA'}

In [39]:
#Fetch the rest of the rows and print the ID and FNAME for those rows
while ibm_db.fetch_row(selectStmt) != False:
   print (" ID:",  ibm_db.result(selectStmt, 0), " FNAME:",  ibm_db.result(selectStmt, "FNAME"))

 ID: 2  FNAME: Raul
 ID: 3  FNAME: Hima

In [41]:
updateQuery = "update INSTRUCTOR set CITY='MOOSETOWN' where FNAME='Rav'"
updateStmt = ibm_db.exec_immediate(conn, updateQuery)

In [42]:
#Retrieve data into pandas
import pandas as pd
import ibm_db_dbi

In [43]:
#Connection for pandas

pconn = ibm_db_dbi.Connection(conn)

In [45]:
#query statement to retrieve all rows in INSTRUCTOR table
selectQuery = "select * from INSTRUCTOR"

#retrieve the query results into a pandas dataframe
pdf = pd.read_sql(selectQuery, pconn)

#print just the LNAME for first row in the pandas data frame
pdf.LNAME[0]

'Ahuja'

In [46]:
pdf

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [47]:
pdf.shape

(3, 5)

In [48]:
#Close the connection

ibm_db.close(conn)

True

Jupyter notebooks have a concept of Magic commands that can simplify working with Python, and are particularly useful for data analysis. Your notebooks can have two types of magic commands:

Cell magics: start with a double %% sign and apply to the entire cell

Line magics: start with a single % (percent) sign and apply to a particular line in a cell

Their usage is of the format:

%magicname arguments

So far in the course you learned to accessed data from a database using the Python DB-API (and specifically ibm_db). With this API execution of queries and fetching their results involves multiple steps. You can use the SQL Magic commands to execute queries more easily.

For example if you want to execute the a query to select some data from a table and fetch its results, you can simply enter a command like the following in your Jupyter notebook cell:

%sql select * from tablename

Although SQL magic simplifies working with databases, it has some limitations. For example, unlike DB-API, there are no explicit methods to close a connection and free up resources.

In the following tutorial you will learn how to work with SQL magic.